constant/momentumTransport.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Air phase: simple Newtonian (constant viscosity)
// Source: PARAMETERS_AgCl.md → Fluid Properties: Air
// Viscosity handled by constant nu in physicalProperties.air
// Using Stokes model (simplest laminar model with constant viscosity)

simulationType  laminar;

laminar
{
    model   Stokes;
}

// ************************************************************************* //
