system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// SIM45: COMSOL geometry with reduced ink volume
// Puit: 0.8 mm x 0.128 mm
// Buse: 0.25 mm x 0.19 mm (ratio 46%)
//
// Air blocks: y ∈ [0, 0.128] mm, x ∈ [0, 0.8] mm
// Ink block:  y ∈ [0.128, 0.318] mm, x ∈ [0.275, 0.525] mm
//
// In meters:
// Ink: X ∈ [0.000275, 0.000525], Y ∈ [0.000128, 0.000318], Z ∈ [0, 0.0001]

defaultFieldValues
(
    volScalarFieldValue alpha.water 0  // Air everywhere initially
);

regions
(
    // Initialize ink in the nozzle region (Block 3 from blockMeshDict)
    // Buse 250 um x 250 um, centered
    boxToCell
    {
        box (0.000275 0.000128 -1) (0.000525 0.000318 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1  // Ink in nozzle
        );
    }
);
